[
  {
    "id": "hsx5gonf9",
    "title": "Cricket in Pakistan",
    "body": "The Pakistan national cricket team has represented Pakistan in international cricket since 1952. It is controlled by the Pakistan Cricket Board (PCB), the governing body for cricket in Pakistan, which is a Full Member of the International Cricket Council (ICC). Pakistan compete in cricket tours and tournaments sanctioned by the PCB and other regional or international cricket bodies in Test, One Day International (ODI), and Twenty20 International (T20) formats. Pakistan are current ICC Champions Trophy holders.",
    "authorId": "nuj8zua0f",
    "authorName": "nawaz ahmed",
    "createdAt": "2025-02-20T20:43:36.272Z",
    "updatedAt": "2025-02-20T20:43:36.272Z"
  },
  {
    "id": "4j53v0pgg",
    "title": "Pakistan Culture ",
    "body": "Civil society in Pakistan is hierarchical, emphasizing local cultural etiquette and traditional Islamic values. The primary family unit is the extended family, but there's a rising trend towards nuclear families due to socio-economic factors.[578][579] Both men and women typically wear Shalwar Kameez; men also favor trousers, jeans, and shirts.[580] The middle class has grown to about 35 million, with another 17 million in the upper and upper-middle classes, leading to a shift in power from rural landowners to urban elites.[581] Festivals like Eid-ul-Fitr, Eid-ul-Azha, Ramadan, Christmas, Easter, Holi, and Diwali are primarily religious.[578] Pakistan ranks 56th on the A.T. Kearney/FP Globalization Index due to increasing globalization.[582]",
    "authorId": "ghubibsle",
    "authorName": "sagar nawaz",
    "createdAt": "2025-02-20T20:47:01.081Z",
    "updatedAt": "2025-02-20T20:47:01.081Z"
  },
  {
    "id": "5iyfebw1q",
    "title": "Artificial Intelligence (AI) ",
    "body": "Artificial Intelligence (AI) is rapidly transforming the world by enabling machines to analyze vast amounts of data, learn from patterns, and make informed decisions, leading to increased efficiency, improved healthcare, personalized experiences, advancements in transportation, and potential solutions to complex global challenges, though concerns remain regarding job displacement and ethical implications of its use.",
    "authorId": "l639mefou",
    "authorName": "ali nawaz",
    "createdAt": "2025-02-20T20:48:19.525Z",
    "updatedAt": "2025-02-20T20:48:19.525Z"
  },
  {
    "id": "bxlqn5fmz",
    "title": "Starlink",
    "body": "Starlink is a satellite internet constellation operated by Starlink Services, LLC, an international telecommunications provider that is a wholly owned subsidiary of American aerospace company SpaceX,[5] providing coverage to over 100 countries and territories. It also aims to provide global mobile broadband.[6] Starlink has been instrumental to SpaceX's growth.[7]\n\nSpaceX started launching Starlink satellites in 2019. As of September 2024, the constellation consists of over 7,000 mass-produced small satellites in low Earth orbit (LEO)[8] that communicate with designated ground transceivers. Nearly 12,000 satellites are planned to be deployed, with a possible later extension to 34,400. SpaceX announced reaching more than 1 million subscribers in December 2022[9] and 4 million subscribers in September 2024.[10]\n\nThe SpaceX satellite development facility in Redmond, Washington, houses the Starlink research, development, manufacturing, and orbit control facilities. In May 2018, SpaceX estimated the total cost of designing, building and deploying the constellation would be at least US$10 billion.[1] Revenues from Starlink in 2022 were reportedly $1.4 billion accompanied by a net loss, with a small profit being reported that began only in 2023.[11] In May 2024 revenue was expected to reach $6.6 billion in 2024[12] but later in that year the prediction was raised to $7.7 billion.[13] Revenue is expected to reach $11.8 billion in 2025.[13]",
    "authorId": "ghubibsle",
    "authorName": "sagar nawaz",
    "createdAt": "2025-02-20T21:05:06.683Z",
    "updatedAt": "2025-02-20T21:05:06.683Z"
  }
]